package com.hyoseop.dec242.main;

//언어
//		조건문
//		반복문
//		Java는 컬렉션 다른언어는 배열
//		객체
//		외부 라이브러리 활용
//		HTTP 통신 Parsing

//배열 : 변수 하나에 데이터를 여러개
//	[]
//	만들때 사이즈가 고정되어 있어서
//	사이즈를 모르면 []을 만드지 못함
//	사이즈는 변경이 불가능!
//컬렉션 : Java에서 자료구조를 구현한 클래스들을 지칭하는 용어
//		자료구조 : (data structure) : 자료를 저장하기 위한 구조
//	List계열
//		가변사이즈
//		순서가 있는 자료구조로 중복된 요소를 가질 수 있음
//	Set 계열
//		가변사이즈
//		중복데이터를 자동으로 삭제
//		순서가 랜덤
//	Map 계열
//		가변사이즈
//		Key값, Value값이 한 쌍
//		순서개념은 없다

public class CMain1 {
	public static void main(String[] args) {
		int [][] score = {{100,90,50}, {10,90,50}, {1,90,30}};
	}
}
